    Starting training:
        Epochs: 5
        Batch size: 1
        Learning rate: 0.1
        Training size: 9668
        Validation size: 508
        Checkpoints: True
        CUDA: False
    
Starting epoch 1/5.

Validation Dice Coeff at batch 1: 0.49202755093574524
Validation Dice Coeff at batch 2: 0.42180195450782776
Validation Dice Coeff at batch 3: 0.3923700451850891
0.0000 --- loss: 0.785027
Pruned conv layer number 7, PrunableConv2d(64, 28, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
Found next conv layer at number 10, PrunableConv2d(28, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
0.0001 --- loss: 0.608460
Pruned conv layer number 21, PrunableConv2d(256, 412, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
Found next conv layer at number 24, PrunableConv2d(412, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
0.0002 --- loss: 0.358893
Pruned conv layer number 21, PrunableConv2d(256, 312, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
Found next conv layer at number 24, PrunableConv2d(312, 512, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
    PrunableConv2d-1         [-1, 64, 640, 640]           1,792
PrunableBatchNorm2d-2         [-1, 64, 640, 640]             128
              ReLU-3         [-1, 64, 640, 640]               0
    PrunableConv2d-4         [-1, 64, 640, 640]          36,928
PrunableBatchNorm2d-5         [-1, 64, 640, 640]             128
              ReLU-6         [-1, 64, 640, 640]               0
     p_double_conv-7         [-1, 64, 640, 640]               0
          p_inconv-8         [-1, 64, 640, 640]               0
         MaxPool2d-9         [-1, 64, 320, 320]               0
   PrunableConv2d-10         [-1, 29, 320, 320]          16,733
PrunableBatchNorm2d-11         [-1, 29, 320, 320]              58
             ReLU-12         [-1, 29, 320, 320]               0
   PrunableConv2d-13        [-1, 128, 320, 320]          33,536
PrunableBatchNorm2d-14        [-1, 128, 320, 320]             256
             ReLU-15        [-1, 128, 320, 320]               0
    p_double_conv-16        [-1, 128, 320, 320]               0
           p_down-17        [-1, 128, 320, 320]               0
        MaxPool2d-18        [-1, 128, 160, 160]               0
   PrunableConv2d-19        [-1, 256, 160, 160]         295,168
PrunableBatchNorm2d-20        [-1, 256, 160, 160]             512
             ReLU-21        [-1, 256, 160, 160]               0
   PrunableConv2d-22        [-1, 256, 160, 160]         590,080
PrunableBatchNorm2d-23        [-1, 256, 160, 160]             512
             ReLU-24        [-1, 256, 160, 160]               0
    p_double_conv-25        [-1, 256, 160, 160]               0
           p_down-26        [-1, 256, 160, 160]               0
        MaxPool2d-27          [-1, 256, 80, 80]               0
   PrunableConv2d-28          [-1, 312, 80, 80]         719,160
PrunableBatchNorm2d-29          [-1, 312, 80, 80]             624
             ReLU-30          [-1, 312, 80, 80]               0
   PrunableConv2d-31          [-1, 512, 80, 80]       1,438,208
PrunableBatchNorm2d-32          [-1, 512, 80, 80]           1,024
             ReLU-33          [-1, 512, 80, 80]               0
    p_double_conv-34          [-1, 512, 80, 80]               0
           p_down-35          [-1, 512, 80, 80]               0
        MaxPool2d-36          [-1, 512, 40, 40]               0
   PrunableConv2d-37          [-1, 512, 40, 40]       2,359,808
PrunableBatchNorm2d-38          [-1, 512, 40, 40]           1,024
             ReLU-39          [-1, 512, 40, 40]               0
   PrunableConv2d-40          [-1, 512, 40, 40]       2,359,808
PrunableBatchNorm2d-41          [-1, 512, 40, 40]           1,024
             ReLU-42          [-1, 512, 40, 40]               0
    p_double_conv-43          [-1, 512, 40, 40]               0
           p_down-44          [-1, 512, 40, 40]               0
         Upsample-45          [-1, 512, 80, 80]               0
   PrunableConv2d-46          [-1, 256, 80, 80]       2,359,552
PrunableBatchNorm2d-47          [-1, 256, 80, 80]             512
             ReLU-48          [-1, 256, 80, 80]               0
   PrunableConv2d-49          [-1, 256, 80, 80]         590,080
PrunableBatchNorm2d-50          [-1, 256, 80, 80]             512
             ReLU-51          [-1, 256, 80, 80]               0
    p_double_conv-52          [-1, 256, 80, 80]               0
             p_up-53          [-1, 256, 80, 80]               0
         Upsample-54        [-1, 256, 160, 160]               0
   PrunableConv2d-55        [-1, 128, 160, 160]         589,952
PrunableBatchNorm2d-56        [-1, 128, 160, 160]             256
             ReLU-57        [-1, 128, 160, 160]               0
   PrunableConv2d-58        [-1, 128, 160, 160]         147,584
PrunableBatchNorm2d-59        [-1, 128, 160, 160]             256
             ReLU-60        [-1, 128, 160, 160]               0
    p_double_conv-61        [-1, 128, 160, 160]               0
             p_up-62        [-1, 128, 160, 160]               0
         Upsample-63        [-1, 128, 320, 320]               0
   PrunableConv2d-64         [-1, 64, 320, 320]         147,520
PrunableBatchNorm2d-65         [-1, 64, 320, 320]             128
             ReLU-66         [-1, 64, 320, 320]               0
   PrunableConv2d-67         [-1, 64, 320, 320]          36,928
PrunableBatchNorm2d-68         [-1, 64, 320, 320]             128
             ReLU-69         [-1, 64, 320, 320]               0
    p_double_conv-70         [-1, 64, 320, 320]               0
             p_up-71         [-1, 64, 320, 320]               0
         Upsample-72         [-1, 64, 640, 640]               0
   PrunableConv2d-73         [-1, 64, 640, 640]          73,792
PrunableBatchNorm2d-74         [-1, 64, 640, 640]             128
             ReLU-75         [-1, 64, 640, 640]               0
   PrunableConv2d-76         [-1, 64, 640, 640]          36,928
PrunableBatchNorm2d-77         [-1, 64, 640, 640]             128
             ReLU-78         [-1, 64, 640, 640]               0
    p_double_conv-79         [-1, 64, 640, 640]               0
             p_up-80         [-1, 64, 640, 640]               0
   PrunableConv2d-81          [-1, 1, 640, 640]              65
        p_outconv-82          [-1, 1, 640, 640]               0
================================================================
Total params: 11,840,960
Trainable params: 11,840,960
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 4.69
Forward/backward pass size (MB): 5563.67
Params size (MB): 45.17
Estimated Total Size (MB): 5613.53
----------------------------------------------------------------
Validation Dice Coeff at batch 1: 0.689022958278656
Validation Dice Coeff at batch 2: 0.7192811965942383
Validation Dice Coeff at batch 3: 0.7747727036476135
Epoch finished ! Loss: 0.8761900067329407